
#Область ПрограммныйИнтерфейс

// Возвращает данные по картинкам текстовых блоков документа.
//
// Параметры:
//  КурсОбученияСсылка - ДокументСсылка.КурсОбучения - ссылка на документ
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица, строки которой содержат идентификаторы текстовых блоков 
//						и данные соответстующих им картинок
//
Функция ПолучитьДанныеКартинокПоКурсуОбучения(КурсОбученияСсылка) Экспорт
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеКартинокТекстовыхБлоковКурсовОбучения.ИдентификаторТекстовогоБлока КАК ИдентификаторТекстовогоБлока,
		|	ДанныеКартинокТекстовыхБлоковКурсовОбучения.АдресДанных КАК АдресДанных,
		|	ДанныеКартинокТекстовыхБлоковКурсовОбучения.ИмяФайла КАК ИмяФайла,
		|	ДанныеКартинокТекстовыхБлоковКурсовОбучения.РасширениеФайла КАК РасширениеФайла,
		|	ДанныеКартинокТекстовыхБлоковКурсовОбучения.РазмерФайла КАК РазмерФайла,
		|	ДанныеКартинокТекстовыхБлоковКурсовОбучения.ДанныеКартинки КАК ДанныеКартинки
		|ИЗ
		|	РегистрСведений.ДанныеКартинокТекстовыхБлоковКурсовОбучения КАК ДанныеКартинокТекстовыхБлоковКурсовОбучения
		|ГДЕ
		|	ДанныеКартинокТекстовыхБлоковКурсовОбучения.КурсОбучения = &КурсОбученияСсылка";
	
	Запрос.УстановитьПараметр("КурсОбученияСсылка", КурсОбученияСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

// Возвращает данные картинки по уникальному идентификатору текстового блока курса обучения.
//
// Параметры:
//  ИдентификаторТекстовогоБлока - Строка - уникальный идентификатор текстового блока
//
// Возвращаемое значение:
//   ХранилищеЗначения, Неопределено - хранилище значения картинки текстового блока, если нет данных - Неопределено
//
Функция ПолучитьДанныеКартинкиПоИдентификаторуТекстовогоБлока(ИдентификаторТекстовогоБлока) Экспорт
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеКартинокТекстовыхБлоковКурсовОбучения.ДанныеКартинки КАК ДанныеКартинки
		|ИЗ
		|	РегистрСведений.ДанныеКартинокТекстовыхБлоковКурсовОбучения КАК ДанныеКартинокТекстовыхБлоковКурсовОбучения
		|ГДЕ
		|	ДанныеКартинокТекстовыхБлоковКурсовОбучения.ИдентификаторТекстовогоБлока = &ИдентификаторТекстовогоБлока";
	
	Запрос.УстановитьПараметр("ИдентификаторТекстовогоБлока", ИдентификаторТекстовогоБлока);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ДанныеКартинки;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура АктуализироватьДанныеКартинокВРегистре(КурсОбученияСсылка, ДанныеКартинокКурса) Экспорт

	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.КурсОбучения.Установить(КурсОбученияСсылка);
	//НаборЗаписей.Записать();
	
	
	
	ДанныеКартинокКурса.Колонки.Добавить("ДанныеКартинки", Новый ОписаниеТипов("ХранилищеЗначения"));
	ДанныеКартинокКурса.Колонки.Добавить("КурсОбучения", Новый ОписаниеТипов("ДокументСсылка.КурсыОбучения"));
	Для Каждого СтрокаТаблицы Из ДанныеКартинокКурса Цикл
		
		Если ЭтоАдресВременногоХранилища(СтрокаТаблицы.АдресКартинки) Тогда
			СтрокаТаблицы.ДанныеКартинки = Новый ХранилищеЗначения(
				ПолучитьИзВременногоХранилища(СтрокаТаблицы.АдресКартинки), Новый СжатиеДанных(9));
		Иначе
				
			ТекущиеДанныеКартинки = ПолучитьДанныеКартинкиПоИдентификаторуТекстовогоБлока(
				СтрокаТаблицы.ИдентификаторТекстовогоБлока);
			Если ТекущиеДанныеКартинки <> Неопределено Тогда
				СтрокаТаблицы.ДанныеКартинки = ТекущиеДанныеКартинки;
			КонецЕсли;
			
		КонецЕсли;
		
		СтрокаТаблицы.АдресКартинки = "";
		
	КонецЦикла;
	
	ДанныеКартинокКурса.ЗаполнитьЗначения(КурсОбученияСсылка, "КурсОбучения");
	
	НаборЗаписей.Загрузить(ДанныеКартинокКурса);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
	
#КонецОбласти
