///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// При создании на сервере.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//
Процедура ПриСозданииНаСервере(Форма) Экспорт
	
	
КонецПроцедуры

// Переопределяет представление типа подписи в форме настроек панели администрирования и тест подсказки в форме подписания.
// 
// Параметры:
//  ТипПодписи - ПеречислениеСсылка.ТипыПодписиКриптографии
//  ПредставлениеПодписи - Строка
//
Процедура ПриЗаполненииПредставленияТипаПодписи(ТипПодписи, ПредставлениеПодписи) Экспорт
	
	
КонецПроцедуры

// Переопределяет настройку использования сервиса мобильной подписи.
// 
// Параметры:
//  Используется - Булево
//
Процедура ПриПолученииНастройкиИспользованияМобильногоСервиса(Используется) Экспорт
	
	
КонецПроцедуры

// Переопределяет заголовок команды для отправки на подписание в мобильный сервис.
// 
// Параметры:
//  Заголовок - Строка
//
Процедура ПриПолученииЗаголовкаКомандыОтправитьНаПодписание(Заголовок) Экспорт
	
	
КонецПроцедуры

// Переопределяет заголовок команды для отправки на подписание в мобильный сервис.
// 
// Параметры:
//  СписокВыбора - СписокЗначений
//
Процедура ПриПолученииТиповПодписания(СписокВыбора) Экспорт
	
	
КонецПроцедуры

// Переопределяет результат отправки на подписание в мобильный сервис.
// 
// Параметры:
//  ИдентификаторыДокументов - Массив из УникальныйИдентификатор
//  Результат - Соответствие:
//                * Ключ - УникальныйИдентификатор
//                * Результат - Структура:
//                   ** Подпись - ДвоичныеДанные
//                   ** ТипПодписи  - ПеречислениеСсылка.ТипыПодписиКриптографии
//                   ** СрокДействияПоследнейМеткиВремени - Дата, Неопределено - заполняется только с помощью
//                        менеджера криптографии.
//                   ** ДатаПодписиИзМетки - Дата, Неопределено - самый ранний штамп времени
//                   ** НеподтвержденнаяДатаПодписи - Дата - неподтвержденная дата подписи.
//                   ** Сертификат  - ДвоичныеДанные - сертификат для проверки подписи.
//                   ** Отпечаток           - Строка - отпечаток сертификата в формате строки Base64.
//                   ** КомуВыданСертификат - Строка - представление субъекта, полученное из двоичных данных сертификата.
//                   ** ДатаПодписи - Дата - дата подписи неподтвержденная
//
Процедура ПриПолученииРезультатаОтправкиНаПодписание(ИдентификаторыДокументов, Результат) Экспорт
	
	
КонецПроцедуры

// При загрузке машиночитаемых доверенностей.
// 
// Параметры:
//  Форма - см. ОбщаяФорма.ДобавлениеЭлектроннойПодписиИзФайла
//
Процедура ПриЗагрузкеМашиночитаемыхДоверенностей(Форма) Экспорт
	
	
КонецПроцедуры

// При получении состояния заявления на выпуск сертификата.
// 
// Параметры:
//  Сертификат - см. ЭлектроннаяПодпись.СостояниеЗаявленияНаВыпускСертификата.Сертификат
//  Результат - см. ЭлектроннаяПодпись.СостояниеЗаявленияНаВыпускСертификата
//
Процедура ПриПолученииСостоянияЗаявленияНаВыпускСертификата(Сертификат, Результат) Экспорт
	
	
КонецПроцедуры

// При заполнении машиночитаемых доверенностей.
// 
// Параметры:
//  Форма - см. ОбщаяФорма.ДобавлениеЭлектроннойПодписиИзФайла
//  ПодписанныйОбъект - ОпределяемыйТип.ПодписанныйОбъект
//
Процедура ПриЗаполненииМашиночитаемыхДоверенностей(Форма, ПодписанныйОбъект = Неопределено) Экспорт
	
	
КонецПроцедуры

// При заполнении машиночитаемой доверенности в строке.
// 
// Параметры:
//  Форма - см. ОбщаяФорма.ДобавлениеЭлектроннойПодписиИзФайла
//  ПодписанныйОбъект - ОпределяемыйТип.ПодписанныйОбъект
//  ИдентификаторСтроки - Число
//
Процедура ПриЗаполненииМашиночитаемойДоверенностиВСтроке(Форма, ИдентификаторСтроки, ПодписанныйОбъект) Экспорт

	
КонецПроцедуры

// См. РаботаСКлассификаторамиПереопределяемый.ПриДобавленииКлассификаторов.
Процедура ПриДобавленииКлассификаторов(Классификаторы) Экспорт
		
	
КонецПроцедуры

// См. РаботаСКлассификаторамиПереопределяемый.ПриЗагрузкеКлассификатора.
Процедура ПриЗагрузкеКлассификатора(Идентификатор, Версия, Адрес, Обработан, ДополнительныеПараметры) Экспорт
	
	
КонецПроцедуры

// При добавлении строк на сервере.
// 
// Параметры:
//  Форма - см. ОбщаяФорма.ДобавлениеЭлектроннойПодписиИзФайла
//  ПомещенныеФайлы - Массив 
//  ДругиеФайлы - Соответствие 
//  ОшибкиПриЗагрузкеДоверенностей - Строка 
//  УникальныйИдентификатор - УникальныйИдентификатор
// 
Процедура ПриДобавленииСтрокНаСервере(Форма, ПомещенныеФайлы, ДругиеФайлы, ОшибкиПриЗагрузкеДоверенностей, УникальныйИдентификатор) Экспорт
	
	
КонецПроцедуры

// При проверке подписей по МЧД.
// 
// Параметры:
//  Подписи - Массив
//  ПодписанныйОбъект - ОпределяемыйТип.ПодписанныйОбъект
//  РезультатыПроверок - Массив
//
Процедура ПриПроверкеПодписейПоМЧД(Подписи, ПодписанныйОбъект, РезультатыПроверок) Экспорт


КонецПроцедуры

// При определении доступности создания заявления.
// 
// Параметры:
//  ДоступностьСозданияЗаявления - см. ЭлектроннаяПодпись.ДоступностьСозданияЗаявления
//
Процедура ПриОпределенииДоступностиСозданияЗаявления(ДоступностьСозданияЗаявления) Экспорт
	
	
КонецПроцедуры

// При заполнении результата проверки удостоверяющего центра.
// 
// Параметры:
//  Результат - см. ЭлектроннаяПодписьСлужебныйКлиентСервер.РезультатПроверкиУдостоверяющегоЦентраПоУмолчанию
//  СертификатКриптографии - СертификатКриптографии
//  НаДату - Дата
//  ПараметрыПроверки - Структура
//  СвойстваСертификата - см. ЭлектроннаяПодпись.СвойстваСертификата
//
Процедура ПриЗаполненииРезультатаПроверкиУдостоверяющегоЦентра(
	Результат, СертификатКриптографии, НаДату, ПараметрыПроверки, СвойстваСертификата) Экспорт
	
	
КонецПроцедуры

// При получении аккредитованных удостоверяющих центров.
// 
// Параметры:
//  АккредитованныеУдостоверяющиеЦентры - Структура
//
Процедура ПриПолученииАккредитованныхУдостоверяющихЦентров(АккредитованныеУдостоверяющиеЦентры) Экспорт
	
	
КонецПроцедуры

// При получении классификатора ошибок криптографии.
// 
// Параметры:
//  ДанныеКлассификатора - Неопределено, Структура
//
Процедура ПриПолученииКлассификатораОшибокКриптографии(ДанныеКлассификатора) Экспорт
	
	
КонецПроцедуры

// При определении доступности проверки по списку УЦ.
// 
// Параметры:
//  ПроверкаДоступна - Булево
//
Процедура ПриОпределенииДоступностиПроверкиПоСпискуУЦ(ПроверкаДоступна) Экспорт
	
	
КонецПроцедуры

// При получении дистрибутива.
// 
// Параметры:
//  Параметры - Структура
//  Идентификатор - Строка
//  Результат - см. ДлительныеОперации.ВыполнитьФункцию 
//
Процедура ПриПолученииДистрибутива(Параметры, Идентификатор, Результат) Экспорт
	
	
КонецПроцедуры

// При обработке результата получения дистрибутива.
// 
// Параметры:
//  ДлительнаяОперация - Структура:
//   * АдресРезультата - Строка - адрес во временном хранилище
//  ИдентификаторФормы - УникальныйИдентификатор
//  Результат - Структура
//
Процедура ПриОбработкеРезультатаПолученияДистрибутива(ДлительнаяОперация, ИдентификаторФормы, Результат) Экспорт
	
	
КонецПроцедуры

// При определении использования сервиса облачной подписи.
// 
// Параметры:
//  Результат - Булево
//
Процедура ПриОпределенииИспользованияСервисаОблачнойПодписи(Результат) Экспорт
	
	
КонецПроцедуры

// При определении типа программы сервиса подписи.
// 
// Параметры:
//  Результат - Тип
//
Процедура ПриОпределенииТипаПрограммыСервисаПодписи(Результат) Экспорт
	
	
КонецПроцедуры

// При получении адресов серверов меток времени.
// 
// Параметры:
//  АдресаСерверовМетокВремени - Строка
//
Процедура ПриПолученииАдресовСерверовМетокВремени(АдресаСерверовМетокВремени) Экспорт
	
	
КонецПроцедуры

// При получении отпечатков облачного сервиса.
// 
// Параметры:
//  МассивОтпечатков - Массив
//
Процедура ПриПолученииОтпечатковОблачногоСервиса(МассивОтпечатков) Экспорт
	
	
КонецПроцедуры

// При добавлении свойств сертификатов облачного сервиса.
// 
// Параметры:
//  ТаблицаСвойствСертификатов - ТаблицаЗначений
//  БезОтбора - Булево
//
Процедура ПриДобавленииСвойствСертификатовОблачногоСервиса(ТаблицаСвойствСертификатов, БезОтбора) Экспорт
	
	
КонецПроцедуры

// При определении настроенного облачного сервиса.
// 
// Параметры:
//  Результат - Булево
//
Процедура ПриОпределенииНастроенногоОблачногоСервиса(Результат) Экспорт
	
	
КонецПроцедуры

// При заполнении сертификатов облачного сервиса.
// 
// Параметры:
//  ОтпечаткиСертификатовНаКлиенте - Массив
//
Процедура ПриЗаполненииСертификатовОблачногоСервиса(ОтпечаткиСертификатовНаКлиенте) Экспорт

		
КонецПроцедуры

#КонецОбласти
