///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Код линии технической поддержки.
// 
// Параметры:
//  Получатель - Строка
//
Процедура ПриОпределенииПолучателяОбращенияВТехническуюПоддержку(Получатель) Экспорт
	
	
КонецПроцедуры

// Фильтр для выбора подписей.
// 
// Параметры:
//  Фильтр - Строка
//
Процедура ПриПолученииФильтраДляВыбораПодписей(Фильтр) Экспорт
	
	
КонецПроцедуры

// Форма направления на подписание в сервис мобильной подписи.
// 
// Параметры:
//  ИмяФормы - Строка
//
Процедура ПриОпределенииФормыНаправленияНаПодписание(ИмяФормы) Экспорт
	
	
КонецПроцедуры

// При получении списка выбора машиночитаемых доверенностей в форме добавления подписей из файла.
// 
// Параметры:
//  Форма - см. ОбщаяФорма.ДобавлениеЭлектроннойПодписиИзФайла
//  ТекущиеДанные - ДанныеФормыЭлементКоллекции - строка подписи в форме ОбщаяФорма.ДобавлениеЭлектроннойПодписиИзФайла
//  СписокВыбора - СписокЗначений
//
Процедура ПриПолученииСпискаВыбораМашиночитаемыхДоверенностей(Форма, ТекущиеДанные, СписокВыбора) Экспорт
	
	
КонецПроцедуры

// При выборе машиночитаемой доверенности в форме добавления подписей из файла.
// 
// Параметры:
//  ОбработчикЗавершения - ОписаниеОповещения
//  ТекущиеДанные - ДанныеФормыЭлементКоллекции - строка подписи в форме ОбщаяФорма.ДобавлениеЭлектроннойПодписиИзФайла 
//
Процедура ПриВыбореМашиночитаемойДоверенности(ОбработчикЗавершения, ТекущиеДанные) Экспорт
	
	
КонецПроцедуры

// Добавляет в список сохраняемых файлы машиночитаемых доверенностей при сохранении подписей.
// 
// Параметры:
//  ФайлыМашиночитаемыхДоверенностей - Соответствие
//  КоллекцияПодписей - ДанныеФормыКоллекция
//
Процедура ПриОпределенииФайловМашиночитаемыхДоверенностей(ФайлыМашиночитаемыхДоверенностей,
		КоллекцияПодписей) Экспорт
		
	
КонецПроцедуры

// При проверке конфликта программ криптографии.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  РезультатПроверки - Структура
//
Процедура ПриПроверкеКонфликтаПрограммКриптографии(Форма, РезультатПроверки) Экспорт
	
	
КонецПроцедуры

// При проверке установленных программ криптографии.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  РезультатПроверки - Структура
//  ЕстьПроверяемыеПрограммы - Булево
//
Процедура ПриПроверкеУстановленныхПрограммКриптографии(Форма, РезультатПроверки, ЕстьПроверяемыеПрограммы) Экспорт
	
	
КонецПроцедуры

// Определяет подключенные токены к устройству.
// 
// Параметры:
//  ОбъектКомпоненты - Неопределено, ОбъектВнешнейКомпоненты.
//  ПредложитьУстановить - Булево - Предложить установить компоненту, если не установлена.
// 
// Возвращаемое значение:
//  Обещание - Структура
//
Асинх Функция УстановленныеТокены(ОбъектКомпоненты = Неопределено, ПредложитьУстановить = Ложь) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("ПроверкаВыполнена", Ложь);
	Результат.Вставить("Токены", Новый Массив);
	Результат.Вставить("Ошибка", "");
	
	
	Возврат Результат;
	
КонецФункции

// Получить свойства сертификатов на токенах.
// 
// Параметры:
//  Контекст - Структура:
//    * МассивСертификатов - Массив
//  ПредложитьУстановить - Булево - Предложить установить компоненту, если не установлена.
// 
// Возвращаемое значение:
//    Обещание - Контекст
//
Асинх Функция ПолучитьСвойстваСертификатовНаТокенах(Контекст, ПредложитьУстановить) Экспорт
	
	
	Возврат Контекст;
	
КонецФункции

// Возвращает отпечатки сертификатов на токенах.
// 
// Параметры:
//  ПредложитьУстановить - Булево - Предложить установить компоненту, если не установлена.
//  ВключаяПросроченные - Булево - если Ложь, возвращаются только отпечатки действующих сертификатов.
// 
// Возвращаемое значение:
//    Обещание - Массив
//
Асинх Функция ПолучитьОтпечаткиСертификатовНаТокенах(ПредложитьУстановить, ВключаяПросроченные = Ложь) Экспорт
	
	МассивОтпечатков = Новый Массив;
	
	
	Возврат МассивОтпечатков;
	
КонецФункции

// Сертификаты на токенах.
// 
// Параметры:
//  ПредложитьУстановить - Булево - Предложить установить.
//  Обновить - Булево - Обновить список сертификатов на токене в кэше.
// 
// Возвращаемое значение:
//  Обещание - Массив Из Структура - Токены
//  
Асинх Функция СертификатыНаТокенах(ПредложитьУстановить, Обновить = Ложь) Экспорт
	
	УстановленныеКриптопровайдеры = Ждать ЭлектроннаяПодписьСлужебныйКлиент.УстановленныеКриптопровайдерыИзКэша(ПредложитьУстановить);
	Токены = УстановленныеКриптопровайдеры.Токены;
	ЗаписатьТокеныВКэш = Ложь;
	
	
	Если ЗаписатьТокеныВКэш Тогда
		УстановленныеКриптопровайдеры.Токены = Токены;
		ЭлектроннаяПодписьСлужебныйКлиент.ЗаписатьВКэшУстановленныеКриптопровайдеры(УстановленныеКриптопровайдеры)
	КонецЕсли;
	
	Возврат Токены;
	
КонецФункции

// Сертификаты на токене.
// 
// Параметры:
//  Токен - Структура
//  ОбъектКомпоненты - Неопределено, ОбъектВнешнейКомпоненты
//  ПредложитьУстановить - Булево - Предложить установить
// 
// Возвращаемое значение:
//  Обещание - Структура
//
Асинх Функция СертификатыНаТокене(Токен, ОбъектКомпоненты = Неопределено, ПредложитьУстановить = Ложь) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ПроверкаВыполнена", Ложь);
	Результат.Вставить("Сертификаты", Новый Массив);
	Результат.Вставить("Ошибка", "");
	
	
	Возврат Результат;
	
КонецФункции

// Токен для шифрования.
// 
// Параметры:
//  Сертификат - СертификатКриптографии
//  АлгоритмШифрования - Строка - OID или см. ЭлектроннаяПодписьКлиент.Зашифровать.ОписаниеДанных.АлгоритмШифрования 
//  СвойстваСертификата - Структура
//  	* АлгоритмОткрытогоКлюча - Строка - OID
// 
// Возвращаемое значение:
//  Обещание - Структура
//
Асинх Функция ТокенДляШифрования(Сертификат, АлгоритмШифрования = Неопределено, СвойстваСертификата = Неопределено) Экспорт
	Результат = Неопределено;
	
	Возврат Результат;
КонецФункции

// Текст ошибки содержит информацию, что введен неправильный пин-код токена.
// 
// Параметры:
//  ТекстОшибки - Строка - текст ошибки
// 
// Возвращаемое значение:
//  Булево
//
Функция ЭтоОшибкаНеправильныйПинКод(ТекстОшибки) Экспорт
	Возврат Ложь;
КонецФункции

// Подпись на токене.
// 
// Параметры:
//  ПараметрыПодписи - Структура:
//    * Токен - Структура
//    * Сертификат - СертификатКриптографии
//    * Пароль - Строка
//    * ТипПодписи - ПеречислениеСсылка.ТипыПодписиКриптографии
//    * Открепленная - Булево
//    * ТипПодписи - ПеречислениеСсылка.ТипыПодписиКриптографии
//    * ОбъектКомпоненты - ОбъектВнешнейКомпоненты
//    * ВключатьСертификатВПодпись - Булево
//  Данные - ДвоичныеДанные
// 
// Возвращаемое значение:
//  Обещание - ДвоичныеДанные, Строка
//
Асинх Функция ПодписьНаТокене(ПараметрыПодписи, Данные) Экспорт
	
	НедоступноСозданиеПодписиТекст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru= 'Недоступно создание подписи с типом %1 на токене.'"), ПараметрыПодписи.ТипПодписи);
	
	
	Возврат НедоступноСозданиеПодписиТекст;

КонецФункции

// Проверяет подпись с помощью токена.
// 
// Параметры:
//  Данные - ДвоичныеДанные, Неопределено - если Неопределено, подпись будет проверяться как присоединенная.
//  Подпись - ДвоичныеДанные
//  ПараметрыПроверки - Структура:
//   * АлгоритмПодписи - Строка
//   * ОбъектКомпоненты - ОбъектВнешнейКомпоненты
//   * ВернутьСертификатыДляПроверки - Булево
// 
// Возвращаемое значение:
//  Обещание - Проверить подпись
//
Асинх Функция ПроверитьПодпись(Данные, Подпись, ПараметрыПроверки) Экспорт
	
	Результат = Неопределено;
	
	
	Возврат Результат;

КонецФункции

// Шифрование на токене.
// 
// Параметры:
//  ПараметрыШифрования - Структура
//  Данные - ДвоичныеДанные
// 
// Возвращаемое значение:
//  Обещание - ДвоичныеДанные, Строка
//
Асинх Функция ШифрованиеНаТокене(ПараметрыШифрования, Данные) Экспорт
	
	Результат = НСтр("ru= 'Недоступно шифрование на токене.'");
	
	
	Возврат Результат;
КонецФункции

// Шифрование на токене.
// 
// Параметры:
//  ПараметрыРасшифровки - Структура
//  Данные - ДвоичныеДанные
// 
// Возвращаемое значение:
//  Обещание - ДвоичныеДанные, Строка
//
Асинх Функция РасшифровкаНаТокене(ПараметрыРасшифровки, Данные) Экспорт
	
	Результат = НСтр("ru= 'Недоступна расшифровка на токене.'");
	
	
	Возврат Результат;
КонецФункции

// Открывает форму установки программ криптопровайдеров.
// 
// Параметры:
//  Параметры - Структура
//  Владелец - ФормаКлиентскогоПриложения
//  Оповещение - ОписаниеОповещения
//  СтандартнаяОбработка - Булево
//
Процедура ПриОткрытииФормыУстановкиПрограммКриптопровайдеров(Параметры, Владелец, Оповещение, СтандартнаяОбработка) Экспорт
	
	
КонецПроцедуры

// При заполнении результата проверки удостоверяющего центра.
// 
// Параметры:
//  Результат - см. ЭлектроннаяПодписьСлужебныйКлиентСервер.РезультатПроверкиУдостоверяющегоЦентраПоУмолчанию
//  СертификатКриптографии - СертификатКриптографии
//  НаДату - Дата
//  ПараметрыПроверки - Структура
//  СвойстваСертификата - см. ЭлектроннаяПодпись.СвойстваСертификата
// 
// Возвращаемое значение:
//  Обещание - см. ЭлектроннаяПодписьСлужебныйКлиентСервер.РезультатПроверкиУдостоверяющегоЦентраПоУмолчанию
//
Асинх Функция ПриЗаполненииРезультатаПроверкиУдостоверяющегоЦентра(
	Результат, СертификатКриптографии, НаДату, ПараметрыПроверки, СвойстваСертификата) Экспорт
	
	
	Возврат Результат;
	
КонецФункции

// Только для внутреннего использования.
// Проверяет установку программ криптографии в рамках проверки установки компонент для работы с электронной подписью.
//
// Параметры:
//  Результат	 - Булево - если Истина, то требуется установка дополнительных компонент.
//  Компоненты	 - см. ЭлектроннаяПодписьСлужебныйКлиент.НовыйКомпонентыРаботыСКриптографией.
//
Процедура ПриПроверкеУстановкиПрограммКриптографии(Результат, Компоненты) Экспорт
	
	
КонецПроцедуры

// При продолжении проверки установленных программ криптографии.
// 
// Параметры:
//  Контекст - Структура - 
//  РезультатПроверки - Структура - 
//  ЕстьПроверяемыеПрограммы - Булево - 
// 
// Возвращаемое значение:
//  Обещание - Булево
//
Асинх Функция ПриПродолженииПроверкиУстановленныхПрограммКриптографии(
		Контекст, РезультатПроверки, ЕстьПроверяемыеПрограммы) Экспорт
	
	
	Возврат Истина;
	
КонецФункции

// При обработке навигационной ссылки классификатора.
// 
// Параметры:
//  Элемент - ДекорацияФормы
//  НавигационнаяСсылкаФорматированнойСтроки - Строка
//  Параметры - Структура
// 
// Возвращаемое значение:
//  Обещание - Булево
//
Асинх Функция ПриОбработкеНавигационнойСсылкиКлассификатора(Элемент, НавигационнаяСсылкаФорматированнойСтроки, Параметры) Экспорт
	
	Возврат Истина;
	
КонецФункции

// Переопределяет параметры подписанта.
// 
// Параметры:
//  ПараметрыПодписанта - Структура
//
Процедура ПриПолученииПараметровПодписанта(ПараметрыПодписанта) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

