///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызывается при начальном заполнении справочника валют для добавления указанных валют из классификатора.
//
// Параметры:
//  КодыВалют - Массив из Строка - цифровые коды добавляемых валют.
//  Валюты - Массив из СправочникСсылка.Валюты - выходной параметр. Добавленные валюты.
//  СтандартнаяОбработка - Булево - выходной параметр. Установить Ложь, если реализовано собственное заполнение.
//
Процедура ПриДобавленииВалютПоКоду(Знач КодыВалют, Валюты, СтандартнаяОбработка) Экспорт


КонецПроцедуры

// Определяет техническую возможность загрузки курсов валют из Интернета
// (наличие такой функциональности в конфигурации).
//
// Параметры:
//  Значение - Булево
//
Процедура ПриОпределенииДоступностиЗагрузкиКурсовВалют(Значение) Экспорт


КонецПроцедуры

// Определяет валюты, для которых есть техническая возможность загрузки курсов из Интернета
// (внешний ресурс предоставляет эти данные).
//
// Параметры:
//  КодыВалютЗагружаемыхИзИнтернета - Массив из Строка - выходной параметр.
//
Процедура ПриОпределенииКодовВалютЗагружаемыхИзИнтернета(КодыВалютЗагружаемыхИзИнтернета) Экспорт


КонецПроцедуры

// Вызывается при загрузке курсы валют на текущую дату.
//
// Параметры:
//  ПараметрыЗагрузки - Структура:
//   * НачалоПериода - Дата - начало периода загрузки.
//   * КонецПериода - Дата - конец периода загрузки.
//   * СписокВалют - ТаблицаЗначений:
//     ** Валюта - СправочникСсылка.Валюты
//     ** КодВалюты - Строка
//  АдресРезультата - Строка - адрес во временном хранилище для помещения результатов загрузки.
//
Процедура ПриЗагрузкеАктуальныхКурсов(ПараметрыЗагрузки = Неопределено, АдресРезультата = Неопределено) Экспорт
	
	
КонецПроцедуры

// См. РаботаСКлассификаторамиПереопределяемый.ПриЗагрузкеКлассификатора.
Процедура ПриЗагрузкеКлассификатора(Идентификатор, Версия, Адрес, Обработан, ДополнительныеПараметры) Экспорт


КонецПроцедуры

// Добавляет новое дело в список на рабочем столе.
//
// Параметры:
//   ТекущиеДела - см. ТекущиеДелаСервер.ТекущиеДела.
//
Процедура ПриЗаполненииСпискаТекущихДел(ТекущиеДела) Экспорт

	
КонецПроцедуры

// Указывает коллекции объектов метаданных, содержащие формы ввода прописей для различных языков.
// Имя формы должно соответствовать шаблону ПараметрыПрописиВалюты_<код языка>. Например, "ПараметрыПрописиВалюты_en".
// 
// Для того, чтобы создать новую форму ввода прописей на нужном языке, необходимо скопировать
// форму ПараметрыПрописиВалюты_en, изменить в ее имени код языка и реализовать в ней заполнение параметров прописи на
// выбранном языке. См. описание параметра ПараметрыПредметаИсчисления в функции ЧислоПрописью в синтакс-помощнике.
// 
// Параметры:
//  КоллекцииФорм - Массив из КоллекцияОбъектовМетаданных - выходной параметр.
//
Процедура ПриОпределенииФормВводаПрописей(КоллекцииФорм) Экспорт


КонецПроцедуры

// См. РегламентныеЗаданияПереопределяемый.ПриОпределенииНастроекРегламентныхЗаданий.
Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт

	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления.
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	
КонецПроцедуры

// См. ИнтернетПоддержкаПользователейПереопределяемый.ПриИзмененииДанныхАутентификацииИнтернетПоддержки.
Процедура ПриИзмененииДанныхАутентификацииИнтернетПоддержки(ДанныеПользователя) Экспорт
	
	
КонецПроцедуры

// См. РаботаВБезопасномРежимеПереопределяемый.ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам.
Процедура ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам(ЗапросыРазрешений) Экспорт
	
	
КонецПроцедуры

#КонецОбласти


