///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Позволяет переопределить список доступных интеграций в зависимости от национальной специфики.
// 
// Параметры:
//  ТипыВнешнихСистем - Массив из Строка - "Telegram", "WebChat", "Webhook", "Webhook" и другие.
//
Процедура ПриОпределенииДоступныхИнтеграций(ТипыВнешнихСистем) Экспорт
	
	
КонецПроцедуры

// Позволяет указать пользовательские инструкции для подключения интеграции с той или иной внешней системой
// в конкретной стране или регионе.
// 
// Параметры:
//  Инструкция - ФорматированнаяСтрока
//  ТипВнешнейСистемы - Строка - "Telegram", "WebChat", "Webhook" или "Webhook".
//
Процедура ПриЗаполненииИнструкцииДляПодключенияИнтеграции(Инструкция, Знач ТипВнешнейСистемы) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

