///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызывается для определения адреса объекта в облачном сервисе файлов.
// 
// Параметры:
//  Сервис - Строка - адрес облачного сервиса файлов, например, "https://dav.dropdav.com".
//  Href - Строка - относительный URL объекта.
//  АдресОбъекта - Строка - возвращаемое значение. 
//
Процедура ПриОпределенииАдресаВОблачномСервисе(Знач Сервис, Знач Href, АдресОбъекта) Экспорт
	
	
КонецПроцедуры

// Вызывается для определения списка облачных сервисов файлов.
// 
// Параметры:
//  Сервисы - СписокЗначений:
//   * Значение - адрес облачного сервиса файлов.
//   * Представление - название облачного сервиса файлов.
//
Процедура ПриОпределенииОблачныхСервисов(Сервисы) Экспорт
	
	
КонецПроцедуры


#КонецОбласти