
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьУсловноеОформление();
	УстановитьПараметрыДинамическогоСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ДоступноИзменениеКурсов = Пользователи.РолиДоступны("ДобавлениеИзменениеКурсовОбучения");
	Элементы.ГруппаДекорацияИнформирование.Видимость = Не ДоступноИзменениеКурсов;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыДинамическогоСписка()
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	ДоступноИзменениеКурсов = Пользователи.РолиДоступны("ДобавлениеИзменениеКурсовОбучения");
	ДоступныеКПрохождениюКурсы = Новый Массив();
	
	Если Не ДоступноИзменениеКурсов Тогда
		ДоступныеКПрохождениюКурсы = ПолучитьСписокДоступныхКурсов(ТекущийПользователь);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список, 
		"ОтображатьТолькоДоступные", 
		Не ДоступноИзменениеКурсов);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список, 
		"ДоступныеКПрохождениюКурсы", 
		ДоступныеКПрохождениюКурсы);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокДоступныхКурсов(Пользователь)
	
	Результат = Новый Массив();
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КурсыОбучения.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.КурсыОбучения КАК КурсыОбучения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КурсыОбучения.Обучающиеся КАК КурсОбученияОбучающиеся
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|			ПО КурсОбученияОбучающиеся.Респондент = Пользователи.Ссылка
		|				И (КурсОбученияОбучающиеся.Респондент = &Пользователь)
		|		ПО КурсыОбучения.Ссылка = КурсОбученияОбучающиеся.Ссылка
		|ГДЕ
		|	КурсыОбучения.Проведен = ИСТИНА
		|	И НЕ Пользователи.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
