///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает описание команд, предназначенные для типа контактной информации, переданного в качестве параметра.
// Полученное соответствие используется в УправлениеКонтактнойИнформациейПереопределяемый.ПриОпределенииНастроек.
// КомандыТипа - выходной параметр.
// 
// Параметры:
//  КомандыТипа - Структура:
//   * Ключ - Строка - имя команды, например "ПоказатьНаКарте".
//   * Значение - см. УправлениеКонтактнойИнформацией.СвойстваКоманды
//  Тип - ПеречислениеСсылка.ТипыКонтактнойИнформации - тип контактной информации.
//
Процедура ПриОпределениеКомандТипаКонтактнойИнформации(КомандыТипа, Тип) Экспорт
	
	
КонецПроцедуры

// Преобразует контактную информацию из формата JSON в формат XML.
//
// Параметры:
//  КонтактнаяИнформацияВJSON - Строка - контактная информация во внутреннем формате JSON.
//  КонтактнаяИнформацияВXML  - Строка - выходной параметр. Контактная информация в формате XML.
//  ОжидаемыйТип              - ПеречислениеСсылка.ТипыКонтактнойИнформации - используется для определения типа, 
//                              если его невозможно вычислить автоматически по данным JSON.
//
Процедура ПриКонвертированииКонтактнуюИнформациюИзJSONВXML(Знач КонтактнаяИнформацияВJSON, КонтактнаяИнформацияВXML, ОжидаемыйТип = Неопределено) Экспорт
	
	
КонецПроцедуры

// При конвертировании контактной информации из XML в объекта XDTO.
// 
// Параметры:
//  Текст - Строка - контактная информация во формате XML
//  КонтактнаяИнформация - ОбъектXDTO -  выходной параметр. Контактная информация в формате объекта XDTO.
//  ОжидаемыйВид - ПеречислениеСсылка.ТипыКонтактнойИнформации - ожидаемый вид типа контактной информации.
//  РезультатПреобразования - Структура:
//    * СведенияИсправлены - Булево - Истина, если сведения были скорректированы 
//                          - Неопределено - преобразование не выполнялось.
//  НастройкиКонвертации - см. УправлениеКонтактнойИнформацией.НастройкиКонвертацииКонтактнойИнформации
//
Процедура ПриКонвертированииКонтактнойИнформацииИзXML(Знач Текст, КонтактнаяИнформация, Знач ОжидаемыйВид = Неопределено, РезультатПреобразования = Неопределено, НастройкиКонвертации = Неопределено) Экспорт
	
	
КонецПроцедуры

// При конвертировании контактной информации в структуру JSON.
// 
// Параметры:
//  КонтактнаяИнформация - Строка - контактная информация во формате XML
//  КонтактнаяИнформацияJSON - Строка -  выходной параметр. Контактная информация в формате JSON
//  Тип - ПеречислениеСсылка.ТипыКонтактнойИнформации - ожидаемый вид типа контактной информации.
//  НастройкиКонвертации - Структура
//
Процедура ПриКонвертированииКонтактнойИнформацииВСтруктуруJSON(КонтактнаяИнформация, КонтактнаяИнформацияJSON, Тип, НастройкиКонвертации) Экспорт
	
	
КонецПроцедуры

// Преобразует входные данные контактной информации в формат XML.
// 
// Параметры:
//  Данные - см. УправлениеКонтактнойИнформациейКлиентСервер.ОписаниеКонтактнойИнформации
//  Результат - см. УправлениеКонтактнойИнформацией.ПоляКонтактнойИнформацииДляПреобразования 
//  СтандартнаяОбработка - Булево - выходной параметр. Установить Ложь, если реализовано собственное преобразование.
// 
Процедура ПриПриведенииКонтактнойИнформацииВXML(Знач Данные, Результат, СтандартнаяОбработка) Экспорт
	
	
КонецПроцедуры

// Выполняет преобразование контактной информации, включающей номер телефона, в объект типа XDTO.
// 
// Параметры:
//  ЗначенияПолей - Строка - контактная информация
//  Результат - ОбъектXDTO - выходной параметр. Результат  преобразования контактной информации в ОбъектXDTO
//  Представление - Строка - представление контактной информации
//  ОжидаемыйТип - ПеречислениеСсылка.ТипыКонтактнойИнформации - тип контактной информации
// 
Процедура ПриКонвертацииТелефонаВОбъектXDTO(ЗначенияПолей, Результат, Представление = "", ОжидаемыйТип = Неопределено) Экспорт
	
	
КонецПроцедуры

// Выполняет преобразование контактной информации, включающей номер факса, в объект типа XDTO.
// 
// Параметры:
//  ЗначенияПолей - Строка - контактная информация
//  Результат - ОбъектXDTO - выходной параметр. Результат  преобразования контактной информации в ОбъектXDTO
//  Представление - Строка - представление контактной информации
//  ОжидаемыйТип - ПеречислениеСсылка.ТипыКонтактнойИнформации - тип контактной информации
// 
Процедура ПриКонвертацииФаксаВОбъектXDTO(ЗначенияПолей, Результат, Представление = "", ОжидаемыйТип = Неопределено) Экспорт
	
	
КонецПроцедуры

// Добавление комментария к контактной информации.
// 
// Параметры:
//  КонтактнаяИнформация - Строка - контактная информация, для которой будет добавлен комментарий.
//  Комментарий - Строка - комментарий контактной информации 
// 
Процедура ПриУстановкеКомментарияКонтактнойИнформации(КонтактнаяИнформация, Знач Комментарий) Экспорт
	
	
КонецПроцедуры

// Определяет тип контактной информации. 
//
// Параметры:
//  XMLСтрока - Строка - контактная информация в формате XML.
//  Тип - ПеречислениеСсылка.ТипыКонтактнойИнформации - выходной параметр. Тип контактной информации.
//
Процедура ПриОпределенииТипаКонтактнойИнформации(Знач XMLСтрока, Тип) Экспорт
КонецПроцедуры

// При преобразовании представления контактной информации в XDTO объект.
// 
// Параметры:
//  Текст - Строка - представление контактной информации.
//  Результат - ОбъектXDTO - выходной параметр. Результат преобразования
//  ОжидаемыйВид - ПеречислениеСсылка.ТипыКонтактнойИнформации - тип контактной информации.
//
Процедура ПриПреобразованииКонтактнойИнформацииXDTOПоПредставлению(Текст, Результат, ОжидаемыйВид) Экспорт
	
	
КонецПроцедуры

// Преобразует контактную информацию из XDTO в XML.
// 
// Параметры:
//  ОбъектXDTOИнформации - ОбъектXDTO - контактная информация в формате объекта XDTO
//  КонтактнаяИнформацияВXML - Строка - выходной параметр. Контактная информация в формате XML.
//
Процедура ПриПреобразованииКонтактнойИнформацииXDTOВXML(ОбъектXDTOИнформации, КонтактнаяИнформацияВXML) Экспорт
	
	
КонецПроцедуры

// При получении строки состава контактной информации.
// 
// Параметры: 
//   XMLДанные - Строка - контактная информация в формате XMLДанные;
//   СтрокаСостава - Строка -  выходной параметр. Строка состава из XML данных.
//
Процедура ПриПолученииСтрокиСоставаКонтактнойИнформации(XMLДанные, СтрокаСостава) Экспорт
	
	
КонецПроцедуры

// При заполнение реквизитов табличной части для веб страницы.
// 
// Параметры:
//  Источник - ОбъектXDTO - источник контактной информации
//  Результат - Строка - результат заполнения
//
Процедура ПриЗаполненииРеквизитовТабличнойЧастиДляВебСтраницы(Источник, Результат) Экспорт
	
	
КонецПроцедуры

// Сравнивает два экземпляра контактной информации.
//
// Параметры:
//    Данные1 - ОбъектXDTO - объект с контактной информацией.
//            - Строка     - контактная информация в формате XML.
//            - Структура  - описание контактной информацию. Ожидаются поля:
//                 * ЗначенияПолей - Строка
//                                 - Структура
//                                 - СписокЗначений
//                                 - Соответствие - поля контактной информации.
//                 * Представление - Строка - представление. Используется в случае, если не удалось вычислить
//                                            представление из ЗначенияПолей (отсутствие в них поля Представление).
//                 * Комментарий - Строка - комментарий. Используется в том случае, если не удалось вычислить комментарий
//                                          из ЗначенияПолей.
//                 * ВидКонтактнойИнформации - СправочникСсылка.ВидыКонтактнойИнформации
//                                           - ПеречислениеСсылка.ТипыКонтактнойИнформации
//                                           - Структура -
//                                             используется в том случае, если не удалось вычислить тип из ЗначенияПолей.
//    Данные2 - ОбъектXDTO
//            - Строка
//            - Структура - смотри описание параметра Данные1.
//    Результат - ТаблицаЗначений:
//      * Путь      - Строка - XPath, идентифицирующий отличающееся значение. Значение "ТипКонтактнойИнформации"
//                             означает, что переданные экземпляры контактной информации различаются типом.
//      * Описание  - Строка - описание отличающегося реквизита в терминах предметной области.
//      * Значение1 - Строка - значение, соответствующая объекту, переданному в параметре Данные1.
//      * Значение2 - Строка - значение, соответствующая объекту, переданному в параметре Данные2.
//
//
// Возвращаемое значение:
//     ТаблицаЗначений: - таблица отличающихся полей со следующими колонками:
//        * Путь      - Строка - XPath, идентифицирующий отличающееся значение. Значение "ТипКонтактнойИнформации"
//                               означает, что переданные экземпляры контактной информации различаются типом.
//        * Описание  - Строка - описание отличающегося реквизита в терминах предметной области.
//        * Значение1 - Строка - значение, соответствующая объекту, переданному в параметре Данные1.
//        * Значение2 - Строка - значение, соответствующая объекту, переданному в параметре Данные2.
//
Процедура ПриОпределенииРазличияКонтактнойИнформации(Знач Данные1, Знач Данные2, Результат) Экспорт
	
	
КонецПроцедуры

// Позволяет выполнить дополнительную проверку и обработку данных о стране, найденной по классификатору.
// 
// Параметры:
//  СтранаПоКлассификатору - СтрокаТаблицыЗначений:
//    * Код                - Строка - данные страны.
//    * Наименование       - Строка - данные страны.
//    * НаименованиеПолное - Строка - данные страны.
//    * КодАльфа2          - Строка - данные страны.
//    * КодАльфа3          - Строка - данные страны.
//
Процедура ПриПроверкеСтраныПослеПоискаСтраныПоКлассификатору(СтранаПоКлассификатору) Экспорт

	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура СкорректироватьКонтактнуюИнформацию(Форма, СтрокаКИ, РезультатПреобразования) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

