             
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "ЗаголовокТекстовогоБлока,Текст,УникальныйИдентификаторВладельца");
	ИдентификаторТекстовогоБлока = ?(ПустаяСтрока(Параметры.ИдентификаторТекстовогоБлока), 
		Строка(Новый УникальныйИдентификатор()), Параметры.ИдентификаторТекстовогоБлока);
		
	//ДокументЗаписан = ЗначениеЗаполнено(Параметры.КурсОбученияСсылка);
	//
	//Элементы.ГруппаИнформацияОЗапретеРаботыСКартинкой.Видимость = Не ДокументЗаписан;
	//Элементы.ГруппаПраво.Видимость = ДокументЗаписан;
	
	Если Параметры.Свойство("ОписаниеКартинки") И Не ПустаяСтрока(Параметры.ОписаниеКартинки.АдресКартинки) Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.ОписаниеКартинки, ПолучитьСписокСвойствСтруктурыОписанияКартинки());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.ЗаголовокТекстовогоБлока) Тогда
		ОбщегоНазначения.СообщитьПользователю("Установите заголовок.",, "ЗаголовокТекстовогоБлока",, Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Текст) Тогда
		ОбщегоНазначения.СообщитьПользователю("Заполните текстовый блок.",, "Текст",, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АдресКартинкиНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;     
	
	Если ЗначениеЗаполнено(АдресКартинки) Тогда
		ПоказатьКартинку();
	Иначе
		ВыбратьКартинку();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СписокСвойств = "ЗаголовокТекстовогоБлока,Текст,ИдентификаторТекстовогоБлока";
	Результат = Новый Структура(СписокСвойств);
	ЗаполнитьЗначенияСвойств(Результат, ЭтаФорма, СписокСвойств);
	
	ОписаниеКартинки = ПолучитьСтруктуруОписанияКартинки();
	ЗаполнитьЗначенияСвойств(ОписаниеКартинки, ЭтаФорма, ПолучитьСписокСвойствСтруктурыОписанияКартинки());
	Результат.Вставить("ДанныеКартинки", ОписаниеКартинки);
	
	ЭтаФорма.Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Асинх Процедура ВыбратьКартинку()
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов();
	ПараметрыДиалога.Заголовок = "Выберите изображение";
	ПараметрыДиалога.Фильтр = "Все файлы изображений | *.jpg; *.png; *.bmp";
	
	ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,, ПараметрыДиалога, ЭтаФорма.УникальныйИдентификаторВладельца);
	Если ОписаниеФайла <> Неопределено Тогда
		
		ЭтаФорма.АдресКартинки 		= ОписаниеФайла.Адрес;
		ЭтаФорма.ИмяФайла 			= ОписаниеФайла.СсылкаНаФайл.Имя;
		ЭтаФорма.РасширениеФайла 	= ОписаниеФайла.СсылкаНаФайл.Расширение;
		ЭтаФорма.РазмерФайла 		= ОписаниеФайла.СсылкаНаФайл.Размер();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПоказатьКартинку()

	ПутьКФайлу = ПолучитьИмяВременногоФайла(ЭтаФорма.РасширениеФайла);
	
	Ждать ПолучитьФайлССервераАсинх(ЭтаФорма.АдресКартинки, ПутьКФайлу);
	
	Попытка
		ЗапуститьПриложениеАсинх(ПутьКФайлу);
	Исключение
		МенеджерОбработкиОшибок = Новый МенеджерОбработкиОшибок();
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстСообщенияОбОшибке = "Не удалось открыть файл картинки по причине: " 
			+ МенеджерОбработкиОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщенияОбОшибке,, АдресКартинки);
	КонецПопытки;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСтруктуруОписанияКартинки()
	
	Результат = Новый Структура();
	
	Результат.Вставить("АдресКартинки", 	"");
	Результат.Вставить("ИмяФайла", 			"");
	Результат.Вставить("РазмерФайла", 		"");
	Результат.Вставить("РасширениеФайла", 	"");
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСписокСвойствСтруктурыОписанияКартинки()
	Возврат "АдресКартинки,ИмяФайла,РазмерФайла,РасширениеФайла";	
КонецФункции

#КонецОбласти






