///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Переопределяет представление сертификата.
// 
// Параметры:
//  Сертификат - СертификатКриптографии
//  РазницаСУниверсальнымВременем - Число
//  Представление - Строка
//
Процедура ПриПолученииПредставленияСертификата(Знач Сертификат, Знач РазницаСУниверсальнымВременем, Представление) Экспорт
	
	
КонецПроцедуры

// Переопределяет представление субъекта сертификата.
// 
// Параметры:
//  Сертификат - СертификатКриптографии
//  Представление - Строка
//
Процедура ПриПолученииПредставленияСубъекта(Знач Сертификат, Представление) Экспорт
	
	
КонецПроцедуры

// Переопределяет структуру расширенных свойств субъекта сертификата.
// 
// Параметры:
//  Субъект - ФиксированнаяСтруктура
//  Свойства - Структура
//
Процедура ПриПолученииРасширенныхСвойствСубъектаСертификата(Знач Субъект, Свойства) Экспорт
	
	
КонецПроцедуры

// Переопределяет структуру расширенных свойств издателя сертификата.
// 
// Параметры:
//  Издатель - ФиксированнаяСтруктура
//  Свойства - Структура
//
Процедура ПриПолученииРасширенныхСвойствИздателяСертификата(Знач Издатель, Свойства) Экспорт
	
	
КонецПроцедуры

// Переопределяет результат сравнения сертификатов по свойствам субъекта.
// 
// Параметры:
//  СвойстваНового - Структура
//  СвойстваСтарого - Структура
//  Результат - Булево
//
Процедура ПриСравненииСертификатов(СвойстваНового, СвойстваСтарого, Результат) Экспорт
	
	
КонецПроцедуры

// При получении конверта XML.
// 
// Параметры:
//  Параметры - Структура
//  КонвертXML - Строка
//
Процедура ПриПолученииКонвертаXML(Параметры, КонвертXML) Экспорт
	
	
КонецПроцедуры

// При получении варианта конверта по умолчанию.
// 
// Параметры:
//  КонвертXML - Строка
//
Процедура ПриПолученииВариантаКонвертаПоУмолчанию(КонвертXML) Экспорт

	
КонецПроцедуры

// Адрес списка отзыва, расположенного на другом ресурсе.
// 
// Параметры:
//  ИмяИздателя - Строка - имя издателя латиницей в нижнем регистре
//  СвойстваСертификата  - ДвоичныеДанные - данные сертификата.
//                       - Строка - адрес данных сертификата.
//                       - Структура - см. ЭлектроннаяПодписьСлужебныйКлиентСервер.СвойстваСертификата
//  КаталогиСписковОтзываУЦ - Строка - имена каталогов для кэширования списков отзыва на собственном ресурсе
//                        из настроек классификатора аккредитованных УЦ, совпадают с именами издателя сертификата.
// 
// Возвращаемое значение:
//  Структура:
//   * АдресВнутренний - Строка - идентификатор для поиска в базе
//   * АдресВнешний - Строка - адрес ресурса для скачивания
//
Функция АдресСпискаОтзываВнутренний(ИмяИздателя, СвойстваСертификата, КаталогиСписковОтзываУЦ) Экспорт
	
	Результат = Новый Структура("АдресВнешний, АдресВнутренний");
	
	ИмяИздателя = СтрЗаменить(ИмяИздателя, " ", "_");
	ИмяИздателя = СокрЛП(СтрСоединить(СтрРазделить(ИмяИздателя, "!*'();«»:@&=+$,/?%#[]\|<>", Истина), ""));
	
	ИмяИздателя = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяИздателя, "");
	
	Если Не ЗначениеЗаполнено(ИмяИздателя) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ТипЗнч(СвойстваСертификата) <> Тип("Структура") Тогда
		СвойстваСертификата = 
			ЭлектроннаяПодписьСлужебныйКлиентСервер.ДополнительныеСвойстваСертификата(СвойстваСертификата, 0);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СвойстваСертификата.ИдентификаторКлючаУдостоверяющегоЦентра) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат.АдресВнутренний = СтрШаблон("%1/%2", ИмяИздателя, НРег(СвойстваСертификата.ИдентификаторКлючаУдостоверяющегоЦентра));
	
	
	Возврат Результат;
	
КонецФункции

// Каталоги списков отзыва УЦ.
// 
// Параметры:
//  АккредитованныеУдостоверяющиеЦентры - Структура
// 
// Возвращаемое значение:
//  Строка - каталоги списков отзыва УЦ
//
Функция КаталогиСписковОтзываУЦ(АккредитованныеУдостоверяющиеЦентры) Экспорт
	
	Возврат "";
	
КонецФункции

// Возвращает данные для проверки удостоверяющего центра.
// 
// Параметры:
//  ЗначенияПоиска - Строка
//  АккредитованныеУдостоверяющиеЦентры - Структура
// 
// Возвращаемое значение:
//  Неопределено
//  Структура:
//   * Государственный - Булево
//   * РазрешенныйНеаккредитованный - Булево
//   * ПериодыДействия - Неопределено, Массив из Структура:
//     **ДатаС - Дата
//     **ДатаПо - Дата, Неопределено
//   * ДатаОкончанияДействия - Неопределено, Дата
//   * ДатаОбновления  - Неопределено, Дата
//   * ДругиеНастройки - Соответствие
//
Функция ДанныеУдостоверяющегоЦентра(ЗначенияПоиска, АккредитованныеУдостоверяющиеЦентры) Экспорт
	
	Результат = Неопределено;
	
	
	Возврат Результат;
	
КонецФункции

// При определении ссылки на инструкцию по работе с программами.
// 
// Параметры:
//  Раздел - Строка
//  НавигационнаяСсылка - Строка
//
Процедура ПриОпределенииСсылкиНаИнструкциюПоРаботеСПрограммами(Раздел, НавигационнаяСсылка) Экспорт
	
	
КонецПроцедуры

// При определении ссылки на поиск по ошибкам при работе с электронной подписью.
// 
// Параметры:
//  НавигационнаяСсылка - Строка
//  СтрокаПоиска - Строка - строка поиска
//
Процедура ПриОпределенииСсылкиНаПоискПоОшибкамПриРаботеСЭлектроннойПодписью(НавигационнаяСсылка, СтрокаПоиска = "") Экспорт
	
	
КонецПроцедуры

// Преобразование передаваемого названия алгоритма в зависимости от передаваемого представления.
// 
// Параметры:
//  АлгоритмШифрования  - Строка
// 
// Возвращаемое значение:
//  Строка
//
Функция ПреобразованныйАлгоритмШифрования(АлгоритмШифрования) Экспорт
	
	Результат = "";
	
	
	Если ПустаяСтрока(Результат) Тогда
		Результат = АлгоритмШифрования;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Реализует альтернативную установку параметров менеджера криптографии.
// Например, если требуется учесть специфику программы электронной подписи и шифрования.
//
// Параметры:
//  ОписаниеПрограммы - см. ЭлектроннаяПодписьСлужебныйПовтИсп.ОписаниеПрограммы
//  Менеджер - МенеджерКриптографии
//  АлгоритмШифрования - Строка
//  Результат - Булево
//
Процедура ПриУстановкеПараметровМенеджераКриптографии(ОписаниеПрограммы, Менеджер, АлгоритмШифрования, Результат) Экспорт
	
	
КонецПроцедуры

// Добавляет наборы алгоритмов для создания подписи с национальной спецификой.
//
// Параметры:
//  Наборы	 - Массив
//
Процедура ПриУстановкеНаборовАлгоритмовДляСозданияПодписи(Наборы) Экспорт
	
	
КонецПроцедуры

// Добавляет наборы алгоритмов шифрования с национальной спецификой.
//
// Параметры:
//  Наборы	 - Массив
//
Процедура ПриУстановкеНаборовАлгоритмовШифрования(Наборы) Экспорт
	
	
КонецПроцедуры

// Добавляет национальные алгоритмы подписи в список актуальных алгоритмов.
// 
// Возвращаемое значение:
//  Массив
//
Функция АктуальныеАлгоритмыПрограмм() Экспорт
	
	Результат = Новый Массив;
	
	
	Возврат Результат;
	
КонецФункции


// Только для внутреннего использования.
// 
// Параметры:
//  Сертификат - СертификатКриптографии
//  КонтекстПроверки - см. КонтекстПроверкиУдостоверяющегоЦентраСертификата
// 
// Возвращаемое значение:
//   См. ЭлектроннаяПодписьСлужебныйКлиентСервер.РезультатПроверкиУдостоверяющегоЦентраПоУмолчанию
//
Функция РезультатПроверкиУдостоверяющегоЦентраСертификата(Сертификат, КонтекстПроверки) Экспорт
	
	РезультатПроверкиУдостоверяющегоЦентра = ЭлектроннаяПодписьСлужебныйКлиентСервер.РезультатПроверкиУдостоверяющегоЦентраПоУмолчанию();
	
	
	Возврат РезультатПроверкиУдостоверяющегоЦентра;
	
КонецФункции

// При получении имени программы электронной подписи.
// 
// Параметры:
//  Криптопровайдер - Структура
//  Результат - Строка
//
Процедура ПриПолученииИмениПрограммыЭлектроннойПодписи(Криптопровайдер, Результат) Экспорт
	
	
КонецПроцедуры

// Это ошибка из-за не установленных библиотек токена.
// 
// Параметры:
//  ТекстОшибки - Строка
//  Результат - Булево
//
Процедура ПриОпределенииОшибкиЗагрузкиБиблиотекТокена(ТекстОшибки, Результат) Экспорт
	
	
КонецПроцедуры

// Ссылка на статью об удостоверяющих центрах.
// 
// Возвращаемое значение:
//  Строка - ссылка на статью об удостоверяющих центрах
//
Функция СсылкаНаСтатьюОбУдостоверяющихЦентрах() Экспорт
	
	Ссылка = "";
	Возврат Ссылка;
	
КонецФункции

#КонецОбласти
